In [2]:
import pandas as pd
import numpy as np
print("Setup complete")

Setup complete

In [7]:
df1 = pd.DataFrame({
    'Salarie':['Eric','Hapsa','Elise','Xin'],
    'groupe':['Tech','Inge','Inge','Tech']})

In [8]:
df2 = pd.DataFrame({
    'Salarie':['Eric','Hapsa','Elise','Xin'],
    'date_embauche':[2001,2003,2010,2019]
})

In [9]:
# merge reconnait la colone en commun et l'utilise comme index
df3 = pd.merge(df1,df2)

In [10]:
df3

  Salarie groupe  date_embauche
0    Eric   Tech           2001
1   Hapsa   Inge           2003
2   Elise   Inge           2010
3     Xin   Tech           2019

In [11]:
df4 = pd.DataFrame({'groupe':['Tech','Inge'],'superviseur':['Carlos','Amine']})

In [12]:
df4

  groupe superviseur
0   Tech      Carlos
1   Inge       Amine

In [13]:
pd.merge(df3,df4)

  Salarie groupe  date_embauche superviseur
0    Eric   Tech           2001      Carlos
1     Xin   Tech           2019      Carlos
2   Hapsa   Inge           2003       Amine
3   Elise   Inge           2010       Amine

In [14]:
df5 = pd.DataFrame({'groupe':['Tech','Inge','Inge','Tech'],'competences':['Tab','ML','RO','CP']})

In [15]:
pd.merge(df3,df5)

  Salarie groupe  date_embauche competences
0    Eric   Tech           2001         Tab
1    Eric   Tech           2001          CP
2     Xin   Tech           2019         Tab
3     Xin   Tech           2019          CP
4   Hapsa   Inge           2003          ML
5   Hapsa   Inge           2003          RO
6   Elise   Inge           2010          ML
7   Elise   Inge           2010          RO

In [22]:
df6 = pd.DataFrame({'Nom':['Hapsa','Elise','Xin','Amine'],'salaire':[90000,10000,80000,100000]})

In [23]:
df6

     Nom  salaire
0  Hapsa    90000
1  Elise    10000
2    Xin    80000
3  Amine   100000

In [24]:
pd.merge(df3,df6, left_on="Salarie",right_on="Nom")

  Salarie groupe  date_embauche    Nom  salaire
0   Hapsa   Inge           2003  Hapsa    90000
1   Elise   Inge           2010  Elise    10000
2     Xin   Tech           2019    Xin    80000

In [25]:
df7 = pd.merge(df3,df6, left_on="Salarie",right_on="Nom").drop("Nom",axis=1)
df7

  Salarie groupe  date_embauche  salaire
0   Hapsa   Inge           2003    90000
1   Elise   Inge           2010    10000
2     Xin   Tech           2019    80000

In [29]:
df8 = pd.merge(df3,df6, left_on="Salarie",right_on="Nom",how='outer').drop("Nom",axis=1)
df8

  Salarie groupe  date_embauche   salaire
0    Eric   Tech         2001.0       NaN
1   Hapsa   Inge         2003.0   90000.0
2   Elise   Inge         2010.0   10000.0
3     Xin   Tech         2019.0   80000.0
4     NaN    NaN            NaN  100000.0

In [35]:
df9 = pd.merge(df3,df6, left_on="Salarie",right_on="Nom",how='left').drop("Nom",axis=1)
df9

  Salarie groupe  date_embauche  salaire
0    Eric   Tech           2001      NaN
1   Hapsa   Inge           2003  90000.0
2   Elise   Inge           2010  10000.0
3     Xin   Tech           2019  80000.0

In [36]:
df10 = pd.merge(df3,df6, left_on="Salarie",right_on="Nom",how='right').drop("Nom",axis=1)
df10

  Salarie groupe  date_embauche  salaire
0   Hapsa   Inge         2003.0    90000
1   Elise   Inge         2010.0    10000
2     Xin   Tech         2019.0    80000
3     NaN    NaN            NaN   100000

In [37]:
df11 = pd.DataFrame({'Salarie':['Eric','Hapsa','Elise','Xin'],'classement':[4,1,2,3]})

In [38]:
df12 = pd.DataFrame({'Salarie':['Eric','Hapsa','Elise','Xin'],'classement':[4,1,3,2]})

In [39]:
df13 = pd.merge(df11, df12, on="Salarie")
df13

  Salarie  classement_x  classement_y
0    Eric             4             4
1   Hapsa             1             1
2   Elise             2             3
3     Xin             3             2